[
  {
    "id": 1,
    "quote": "Jordan's superpower is translating difficult, complex topics with a wide variety of opinionated stakeholders. She turned our Sonatype Guide prototypes and user flows into a live web application that our engineering team could reference as they began their work. Additionally, she actively supported her teams and made regular contributions to the codebase, addressing minor UX issues to maintain the team's flow state.",
    "author": "Meredith E.",
    "role": "Director, Product Management",
    "featured": true,
    "approved": true,
    "timestamp": "2025-11-19T17:47:00Z"
  },
  {
    "id": 2,
    "quote": "Jordan is one of the most diligent designers that I've worked with throughout my career. Whenever she is given a task, she digs in, seeking to genuinely understand the use case at hand so that she can create the clearest and most effective user experience. This depth of understanding, along with her attention to detail, enabled her to solve some of our product group's most complex workflow challenges. Her eye towards consistency and appreciation of accessible web standards have helped elevate the quality of our products. Jordan is an experienced remote worker accustomed to collaborating with all levels of the organizational hierarchy, from individual contributors to C-suite executives. She is a valuable addition to any development team, and a joy to work with.",
    "author": "Ross P.",
    "role": "Principal Software Engineer",
    "featured": true,
    "approved": true,
    "timestamp": "2025-11-20T08:53:00Z"
  },
  {
    "id": 3,
    "quote": "I had the pleasure to work with Jordan Walz for the past four years and she consistently delivers thoughtful, high-quality work. Jordan is a quick learner who picks up new concepts easily and applies them effectively in her design process. She's flexible, open to feedback, and willing to experiment with new approaches when the situation calls for it.\nJordan brings a calm, collaborative presence to the team. She's confident in sharing her perspective and comfortable engaging in constructive debate, always with the goal of finding the best outcome for users and the business. She demonstrates a strong balance between individual contribution and team collaboration, and she leads by example through her work ethic and thoughtful approach.\nShe takes the time to understand users and their behaviors, and that empathy shows up in her design decisions. Even when faced with challenging situations, Jordan handles them with professionalism and grace. She's a dependable teammate and someone who makes a positive impact on any project she's part of.",
    "author": "Matt J.",
    "role": "Principal Software Engineer",
    "featured": true,
    "approved": true,
    "timestamp": "2025-11-20T12:51:00Z"
  }
]